/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */


import java.io.BufferedReader;
import java.io.File;
import java.io.FileReader;
import java.io.IOException;
import static java.lang.System.in;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

/**
 *
 * @author Aleksandar
 * 
 */




public class MKMoreSpecific {
    
    public static String[] pairs = 
    {
                "архиереј/архиереи",
                "бој/бои",
                "број/брои",
                "буј/буи",
                "водостој/водостои",
                "волеј/волеи",
                "гној/гнои",
                "антихерој/антихерои",
                "гој/гои",
                "двобој/двобои",
                "диџеј/диџеи",
                "добој/добои",
                "доброј/доброи",
                "додој/додои",
                "дој/дои",
                "докрој/докрои",
                "достој/достои",
                "есеј/есеи",
                "завој/завои",
                "загној/загнои",
                "задој/задои",
                "застој/застои",
                "затај/затаи",
                "згој/згои",
                "изброј/изброи",
                "издвој/издвои",
                "искрој/искрои",
                "јубилеј/јубилеи",
                "коб/коп",
                "куб/куп",
                "раб/рап",
                "слаб/слап",
                "сноб/сноп",
                "лав/лаф",
                "блог/блок",
                "бог/бок",
                "лаг/лак",
                "маг/мак",
                "рог/рок",
                "смог/смок",
                "снег/снек",
                "тег/тек",
                "ад/ат",
                "бод/бот",
                "год/гот",
                "јад/јат",
                "кад/кат",
                "лед/лет",
                "луд/лут",
                "плод/плот",
                "под/пот",
                "без/бес",
                "газ/гас",
                "јаз/јас",
                "лоз/лос",
                "оваа/ова",
                "онаа/она",
                "зааби/заби",
                "касај/касаи",
                "каубој/каубои",
                "кој/кои",
                "корифеј/корифеи",
                "крој/крои",
                "лакеј/лакеи",
                "леј/леи",
                "лифтбој/лифтбои",
                "лишај/лишаи",
                "лој/лои",
                "мавзолеј/мавзолеи",
                "мај/Маи",
                "мој/мои",
                "музеј/музеи",
                "набој/набои",
                "наброј/наброи",
                "набуј/набуи",
                "навој/навои",
                "навој/навои",
                "надој/надои",
                "напој/напои",
                "нарој/нарои",
                "настрој/настрои",
                "некој/некои",
                "неспокој/неспокои",
                "нечиј/нечии",
                "никој/никои",
                "ничиј/ничии",
                "обичај/обичаи",
                "обој/обои",
                "опстој/опстои",
                "освој/освои",
                "осој/осои",
                "открој/открои",
                "отсјај/отсјаи",
                "отстој/отстои",
                "плејбој/плејбои",
                "повој/повои",
                "подој/подои",
                "пој/пои",
                "покрој/покрои",
                "понекој/понекои",
                "порој/порои",
                "посвој/посвои",
                "постој/постои",
                "построј/построи",
                "преброј/преброи",
                "превој/превои",
                "престој/престои",
                "припој/припои",
                "присвој/присвои",
                "присој/присои",
                "притај/притаи",
                "протоереј/протоереи",
                "разбој/разбои",
                "раздвој/раздвои",
                "растрој/растрои",
                "релеј/релеи",
                "рој/рои",
                "самурај/самураи",
                "свој/свои",
                "секој/секои",
                "сечиј/сечии",
                "скрој/скрои",
                "славеј/славеи",
                "случај/случаи",
                "смеј/смеи",
                "спој/спои",
                "спокој/спокои",
                "стај/стаи",
                "стечај/стечаи",
                "стој/стои",
                "строј/строи",
                "суперхерој/суперхерои",
                "тај/таи",
                "твој/твои",
                "трофеј/трофеи",
                "усвој/усвои",
                "усој/усои",
                "херој/херои",
                "чиј/чии",
                "џокеј/џокеи",
                "шебој/шебои",
                "штафелај/штафелаи",
                "којшто/коишто",
                "некојси/некоиси",
                "кој-годе/кои-годе",
                "сваќа/сфаќа",
                "маала/мала",
                "маало/мало",
                "наалан/налан",
                "веел/вел",
                "зреел/зрел",
                "зреела/зрела",
                "зреело/зрело",
                "сеела/села",
                "сеело/село",
                "смеел/смел",
                "смеела/смела",
                "смеело/смело",
                "дообере/добере",
                "доотепа/дотепа",
                "пообели/побели",
                "пообогати/побогати",
                "поободри/пободри",
                "пооветви/поветви",
                "поогладни/погладни",
                "поогледа/погледа",
                "пооглода/поглода",
                "пооголи/поголи",
                "поогребе/погребе",
                "поогрее/погрее",
                "поогризе/погризе",
                "поодбере/подбере",
                "поодвикне/подвикне",
                "поодврзе/подврзе",
                "поожедни/пожедни",
                "пооживи/поживи",
                "поожнее/пожнее",
                "пооздрави/поздрави",
                "поокоси/покоси",
                "поолабави/полабави",
                "пооладни/поладни",
                "поолесни/полесни",
                "поопасе/попасе",
                "поопере/попере",
                "поопече/попече",
                "пооплеска/поплеска",
                "поора/пора",
                "поосвежи/посвежи",
                "поосветли/посветли",
                "поосети/посети",
                "поослаби/послаби",
                "поосмели/посмели",
                "поосоли/посоли",
                "поостари/постари",
                "поотече/потече",
                "пооткова/поткова",
                "поотплати/потплати",
                "поотрезни/потрезни",
                "поотуѓи/потуѓи",
                "поохрабри/похрабри",
                "пооцрни/поцрни",
                "пооцрта/поцрта",
                "наддаде/нададе",
                "оддел/одел",
                "поддаде/подаде",
                "поддотера/подотера",
                "поддржи/подржи",
                "иззел/изел",
                "иззела/изела",
                "иззеле/изеле",
                "иззело/изело",
                "раззори/разори",
                "дваесеттина/дваесетина",
                "деведесеттина/деведесетина",
                "деветтини/деветини",
                "десеттина/десетина",
                "осумдесеттина/осумдесетина",
                "педесеттина/педесетина",
                "петнаесеттина/петнаесетина",
                "петта/пета",
                "петтина/петина",
                "седумдесеттина/седумдесетина",
                "триесеттина/триесетина",
                "четириесеттина/четириесетина",
                "шеесеттина/шеесетина",
                "Мија/Миа",
                "Андријана/Андриана",
                "Андреја/Андреа",
                "Мија/Миа",
                "Мија/Миа",
                "Биј/Би",
                "Трчаат/Трчат",
                "Рај/Раи",
                
    };
    
    public static String[] falsePositives = {
        "Заби/Запи",
        "Вака/Вага",
        "Ката/Када",
        "Каза/Каса",
        "Коба/Копа",
    };

    public static void main(String[] args) throws IOException {
        List<String> falseResults = new ArrayList();
        for(String i : pairs){
            String[] strs = i.split("/");
            System.out.println(i + " " + strs[0] + ": " + soundex(strs[0]) + " vs " + strs[1] + ": " + soundex(strs[1]));
               if(!verifySoundex(strs[0], strs[1])){
                   falseResults.add(i + " " + strs[0] + ": " + soundex(strs[0]) + " vs " + strs[1] + ": " + soundex(strs[1]));
               }
        }
        
        if(falseResults.isEmpty()){
            System.out.println("No false results! All words that sound the same have matching codes");
        }else{
            for(int i = 0; i< falseResults.size(); i++){
                System.out.println(falseResults.get(i));
            }
        }
        falseResults.clear();
        for(String i : falsePositives){
            String[] strs = i.split("/");
            System.out.println(i + " " + strs[0] + ": " + soundex(strs[0]) + " vs " + strs[1] + ": " + soundex(strs[1]));
               if(verifySoundex(strs[0], strs[1])){
                   System.out.println(i + " " + strs[0] + ": " + soundex(strs[0]) + " vs " + strs[1] + ": " + soundex(strs[1]));
               }
        }
        falseResults.clear();
        if(falseResults.isEmpty()){
            System.out.println("No false positives were generated");
        }else{
            System.out.println("False positives were generated");
            for(int i = 0; i< falseResults.size(); i++){
                System.out.println(falseResults.get(i));
            }
        }   
    }
    
    public static boolean verifySoundex(String str1,String str2){
        return soundex(str1).equals(soundex(str2));
    }
    
    public static String soundex(String str){
        str = str.toLowerCase();
        str = str.replace("зз", "з");
        str = str.replace("тт", "т");
        str = str.replace("дд", "д");
        str = str.replace("аа", "1");
        str = str.replace("ее", "2");
        str = str.replace("оо", "4"); 
        
        str = str.replace("кој", "кои");
        str = str.replace("иј", "ии");
        str = str.replace("еја", "ееа");

        char[] x = str.toCharArray();
        switch(x[x.length-1]){
            case 'ј': x[x.length-1] = 'и'; break;
            case 'г': x[x.length-1] = 'к'; break;
            case 'д': x[x.length-1] = 'т'; break;
            case 'з': x[x.length-1] = 'с'; break;
            case 'б': x[x.length-1] = 'п'; break;
            default: break;
        }
        
        for(int i = 1; i < x.length;i++){
            switch(x[i]){
                case 'а' : x[i] = '1'; break;
                case 'е' : x[i] = '2'; break;
                case 'и' : x[i] = '3'; break;
                case 'о' : x[i] = '4'; break;
                case 'у' : x[i] = '5'; break;
                case 'в' : x[i] = 'ф'; break;
                default: break;
            }
        }
        str = new String(x);
        str = str.replace("33","3");
        str = str.replace("22","2");
        x = str.toCharArray();
        
        StringBuilder newString = new StringBuilder();
        for (char c : x){
             newString.append(c);
        }
        if(newString.length() < 6){
            for (int i = 0; i < 6 - newString.length(); i++){
                newString.append('0');
            }
            return newString.toString().toUpperCase();
        }
        else {
            return newString.toString().toUpperCase();
        }
    }
}
